#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
github_team.teams["distribution"]: Refreshing state... [id=6847101]
github_team.teams["infrastructure"]: Refreshing state... [id=6847100]
github_team.teams["content"]: Refreshing state... [id=6847102]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_team.teams["tech-lead"]: Refreshing state... [id=6847098]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
github_team.teams["continuous-integration"]: Refreshing state... [id=6847099]
github_repository.repositories["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["terraform"]: Refreshing state... [id=terraform]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=mirror-commerce-admin.en]
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=mirror-commerce-operations.en]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_membership.users["mage-os-ci"]: Refreshing state... [id=Mage-OS:mage-os-ci]
github_membership.users["sprankhub"]: Refreshing state... [id=Mage-OS:sprankhub]
github_membership.users["wigman"]: Refreshing state... [id=Mage-OS:wigman]
github_membership.users["Vinai"]: Refreshing state... [id=Mage-OS:Vinai]
github_membership.users["DavidLambauer"]: Refreshing state... [id=Mage-OS:DavidLambauer]
github_membership.users["damienwebdev"]: Refreshing state... [id=Mage-OS:damienwebdev]
github_membership.users["johnhughes1984"]: Refreshing state... [id=Mage-OS:johnhughes1984]
github_team_membership.members["wigman_content"]: Refreshing state... [id=6847102:wigman]
github_team_membership.members["johnhughes1984_content"]: Refreshing state... [id=6847102:johnhughes1984]
github_team_membership.members["sprankhub_distribution"]: Refreshing state... [id=6847101:sprankhub]
github_team_membership.members["damienwebdev_infrastructure"]: Refreshing state... [id=6847100:damienwebdev]
github_team_membership.members["sprankhub_infrastructure"]: Refreshing state... [id=6847100:sprankhub]
github_team_membership.members["mage-os-ci_continuous-integration"]: Refreshing state... [id=6847099:mage-os-ci]
github_team_membership.members["DavidLambauer_infrastructure"]: Refreshing state... [id=6847100:DavidLambauer]
github_team_membership.members["Vinai_infrastructure"]: Refreshing state... [id=6847100:Vinai]
github_team_membership.members["damienwebdev_distribution"]: Refreshing state... [id=6847101:damienwebdev]
github_team_membership.members["Vinai_distribution"]: Refreshing state... [id=6847101:Vinai]
github_team_membership.members["Vinai_content"]: Refreshing state... [id=6847102:Vinai]
github_team_membership.members["Vinai_tech-lead"]: Refreshing state... [id=6847098:Vinai]
github_team_repository.teams["mageos-magento-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-magento-composer-installer]
github_team_repository.teams["mage-os-website_content"]: Refreshing state... [id=6847102:mage-os-website]
github_team_repository.teams["mageos-inventory-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-inventory-composer-installer]
github_team_repository.teams["mageos-commerce-data-export_distribution"]: Refreshing state... [id=6847101:mageos-commerce-data-export]
github_team_repository.teams["mageos-magento2-sample-data_distribution"]: Refreshing state... [id=6847101:mageos-magento2-sample-data]
github_team_repository.teams["dev-env-gitpod_infrastructure"]: Refreshing state... [id=6847100:dev-env-gitpod]
github_team_repository.teams["mageos-composer-root-update-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-root-update-plugin]
github_team_repository.teams["mageos-magento2_distribution"]: Refreshing state... [id=6847101:mageos-magento2]
github_team_repository.teams["mageos-security-package_distribution"]: Refreshing state... [id=6847101:mageos-security-package]
github_team_repository.teams["mageos-inventory_distribution"]: Refreshing state... [id=6847101:mageos-inventory]
github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-dependency-version-audit-plugin]
github_team_repository.teams["namespace_infrastructure"]: Refreshing state... [id=6847100:namespace]
github_team_repository.teams["terraform_infrastructure"]: Refreshing state... [id=6847100:terraform]
github_team_repository.teams["infrastructure_infrastructure"]: Refreshing state... [id=6847100:infrastructure]
github_team_repository.teams["mageos-adobe-stock-integration_distribution"]: Refreshing state... [id=6847101:mageos-adobe-stock-integration]
github_team_repository.teams["generate-mirror-repo-js_infrastructure"]: Refreshing state... [id=6847100:generate-mirror-repo-js]
github_team_repository.teams["mageos-magento2-page-builder_distribution"]: Refreshing state... [id=6847101:mageos-magento2-page-builder]
github_team_repository.tech-lead["mageos-commerce-data-export"]: Refreshing state... [id=6847098:mageos-commerce-data-export]
github_team_repository.tech-lead["mageos-adobe-stock-integration"]: Refreshing state... [id=6847098:mageos-adobe-stock-integration]
github_team_repository.tech-lead["terraform"]: Refreshing state... [id=6847098:terraform]
github_team_repository.tech-lead["mageos-inventory-composer-installer"]: Refreshing state... [id=6847098:mageos-inventory-composer-installer]
github_team_repository.tech-lead["mageos-magento-composer-installer"]: Refreshing state... [id=6847098:mageos-magento-composer-installer]
github_team_repository.tech-lead["mageos-magento2"]: Refreshing state... [id=6847098:mageos-magento2]
github_team_repository.tech-lead["generate-mirror-repo-js"]: Refreshing state... [id=6847098:generate-mirror-repo-js]
github_team_repository.tech-lead["mageos-magento2-page-builder"]: Refreshing state... [id=6847098:mageos-magento2-page-builder]
github_team_repository.tech-lead["mageos-security-package"]: Refreshing state... [id=6847098:mageos-security-package]
github_team_repository.tech-lead["mageos-inventory"]: Refreshing state... [id=6847098:mageos-inventory]
github_team_repository.tech-lead["infrastructure"]: Refreshing state... [id=6847098:infrastructure]
github_team_repository.tech-lead["mage-os-website"]: Refreshing state... [id=6847098:mage-os-website]
github_team_repository.tech-lead["mageos-magento2-sample-data"]: Refreshing state... [id=6847098:mageos-magento2-sample-data]
github_team_repository.tech-lead["namespace"]: Refreshing state... [id=6847098:namespace]
github_team_repository.tech-lead["mageos-composer-root-update-plugin"]: Refreshing state... [id=6847098:mageos-composer-root-update-plugin]
github_team_repository.tech-lead["dev-env-gitpod"]: Refreshing state... [id=6847098:dev-env-gitpod]
github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=6847098:mageos-composer-dependency-version-audit-plugin]
github_repository_file.codeowners["mage-os-website"]: Refreshing state... [id=mage-os-website/CODEOWNERS]
github_repository_file.codeowners["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory"]: Refreshing state... [id=mageos-inventory/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2"]: Refreshing state... [id=mageos-magento2/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/CODEOWNERS]
github_repository_file.codeowners["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/CODEOWNERS]
github_repository_file.codeowners["mageos-security-package"]: Refreshing state... [id=mageos-security-package/CODEOWNERS]
github_repository_file.codeowners["infrastructure"]: Refreshing state... [id=infrastructure/CODEOWNERS]
github_repository_file.codeowners["terraform"]: Refreshing state... [id=terraform/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/CODEOWNERS]
github_repository_file.codeowners["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod/CODEOWNERS]
github_repository_file.codeowners["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/CODEOWNERS]
github_repository_file.codeowners["namespace"]: Refreshing state... [id=namespace/CODEOWNERS]
github_branch_protection.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOISiM084BzuWR]
github_branch_protection.repositories["infrastructure"]: Refreshing state... [id=BPR_kwDOGHBGY84BysK_]
github_branch_protection.repositories["mageos-security-package"]: Refreshing state... [id=BPR_kwDOIShpTM4BzuWV]
github_branch_protection.repositories["mageos-inventory"]: Refreshing state... [id=BPR_kwDOIShsYM4BzuWO]
github_branch_protection.repositories["dev-env-gitpod"]: Refreshing state... [id=BPR_kwDOIfCi6c4B3JNi]
github_branch_protection.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOISiZ3M4BzuWZ]
github_branch_protection.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOISimRc4BzuWh]
github_branch_protection.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOISihV84BzuWa]
github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOISiqV84BzuWX]
github_branch_protection.repositories["terraform"]: Refreshing state... [id=BPR_kwDOHNQe7c4BysLD]
github_branch_protection.repositories["mageos-commerce-data-export"]: Refreshing state... [id=BPR_kwDOISixH84BzuWN]
github_branch_protection.repositories["mageos-magento2"]: Refreshing state... [id=BPR_kwDOH66Nbs4BysK-]
github_branch_protection.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOISiVZc4BzuWM]
github_branch_protection.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOISivQc4BzuWP]
github_branch_protection.repositories["namespace"]: Refreshing state... [id=BPR_kwDOGIl6i84BysLC]
github_branch_protection.repositories["generate-mirror-repo-js"]: Refreshing state... [id=BPR_kwDOGta9mM4B0QmJ]
github_branch_protection.repositories["mage-os-website"]: Refreshing state... [id=BPR_kwDOGCTTT84BysLE]
github_branch_protection.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOGMKCJ84By-dW]
github_branch_protection.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOG3Ro_84By-dJ]
github_branch_protection.mirrors["mirror-adobe-ims"]: Refreshing state... [id=BPR_kwDOG8FV-s4By-dL]
github_branch_protection.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOG8FefM4By-dZ]
github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOG1y7C84By-d5]
github_branch_protection.mirrors["mirror-zf1"]: Refreshing state... [id=BPR_kwDOGMKC6M4By-d2]
github_branch_protection.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=BPR_kwDOH_yQpc4B1Gmt]
github_branch_protection.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=BPR_kwDOIIQUpM4By-eH]
github_branch_protection.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=BPR_kwDOH_yQXM4B1Gm0]
github_branch_protection.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOG1y6y84By-df]
github_branch_protection.mirrors["mirror-page-builder-types"]: Refreshing state... [id=BPR_kwDOGMKFF84By-dc]
github_branch_protection.mirrors["mirror-composer"]: Refreshing state... [id=BPR_kwDOHynKTc4By-d9]
github_branch_protection.mirrors["mirror-magento2"]: Refreshing state... [id=BPR_kwDOGHBHCc4By-d4]
github_branch_protection.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOGMKAG84By-dP]
github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=BPR_kwDOG3Rr984By-dH]
github_branch_protection.mirrors["mirror-inventory"]: Refreshing state... [id=BPR_kwDOGMKBz84By-dN]
github_branch_protection.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOG8L6gs4By-eB]
github_branch_protection.mirrors["mirror-security-package"]: Refreshing state... [id=BPR_kwDOGMKCY84By-d1]
github_branch_protection.mirrors["mirror-devdocs"]: Refreshing state... [id=BPR_kwDOGwaLE84By-dS]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_membership.users["DavidLambauer"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"ef77d0f3f097784b6b6c809dd2fd186162f3a33aafae8d79d37c0dfc853e387c\"" -> "W/\"98419cd6f6a0a28236b36c043185892c86801d805055e9d15ccc261f1ef24dc9\""
        id       = "Mage-OS:DavidLambauer"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["Vinai"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"425d63e66d5feddadb52f6fa9d0a389db22b1e38507e7b853a299eb4b55ffb9e\"" -> "W/\"47e4af4ea29aad4e083b50391d978f5135c1b60237c154679a6b26bc40ca93a8\""
        id       = "Mage-OS:Vinai"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["damienwebdev"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"6fad3e5efb2144e157846f5b5120a2a69a01b19ffa525191b396fa37c65c4ede\"" -> "W/\"6e9b948d4b499cd797c3c5149cc6f6122eaa3ee965f836435a40634ac64d6d19\""
        id       = "Mage-OS:damienwebdev"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["johnhughes1984"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"2a0a3d804ae2912c754f0b615f196fd138cbfb58e29ccc057b446b3f0d57433a\"" -> "W/\"f5cec6a21ce14a412ff2eccbcf0ee79717d6e0eb7cc3a47674b3487673b6acfd\""
        id       = "Mage-OS:johnhughes1984"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["mage-os-ci"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"7792e2dccff1d238859f36912a0d8970d3210ca2802ee6d733660dbfd049385e\"" -> "W/\"6c479ba67b49aa401688abbcca84a8c95e7856e26062d098828300cf71e53de0\""
        id       = "Mage-OS:mage-os-ci"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["sprankhub"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"6fa42c8145ef21690d7dabaad3b04c3c71bba1381b9a2e336010ac27ae8ef063\"" -> "W/\"de70fc0dae21e92ebd40f403ecd7f7112280b63055d6dc94abcacb797eb14975\""
        id       = "Mage-OS:sprankhub"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["wigman"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"48a4bdb997b348bfb206cef75e4cc16ea2bcb21d1ebed3acdc9f1501d613e346\"" -> "W/\"e79fbdaab2367496eed03898a561870414cba830e5a46325778375f6dfac9d8a\""
        id       = "Mage-OS:wigman"
        # (2 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-adobe-ims"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"fffca5934d79610a5026436f38bf32834a02a340f2cef112e86f2f7ddd975b8d\"" -> "W/\"01ed1e56ac0fd8ae4fc141be6a449d3b9acf74a6b42a2e41148caaf1dad24b1a\""
        id                          = "mirror-adobe-ims"
        name                        = "mirror-adobe-ims"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-adobe-stock-integration"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"f57e1a1ad59f981e6afc3befeb128bba06e4f6dcd58c3341174523984175d8d2\"" -> "W/\"c8e320a5c386b29b4601d642fd78cdf8695636152160f0233df3ca8a4bb80441\""
        id                          = "mirror-adobe-stock-integration"
        name                        = "mirror-adobe-stock-integration"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-commerce-admin.en"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"f22113d792f4c5680f6e7cd850656cb8e765cd3fe9fde717fc942eaac6c79672\"" -> "W/\"5999c3352a69d088221c45dbb0f666908a0bad77cba9f0b34885b407693aa419\""
        id                          = "mirror-commerce-admin.en"
        name                        = "mirror-commerce-admin.en"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-commerce-data-export"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"5e5e2bf595a9f9e908600b2ae53d2709da973d582e1147b77c2fe32fdac9babd\"" -> "W/\"0e25e3e690e4792942d3931ccbf38716163f5ed107d9e602cbc4a6f34fc324d7\""
        id                          = "mirror-commerce-data-export"
        name                        = "mirror-commerce-data-export"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-commerce-operations.en"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"4e12c3781b3c126d6a01650311234bac3227ceb4029c6e62e0dd052f7f985ac5\"" -> "W/\"b8b93eb69ccead6679fb8c7a34ee43897779512e45e15d05db29035f9db319e2\""
        id                          = "mirror-commerce-operations.en"
        name                        = "mirror-commerce-operations.en"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-composer"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"534aa5046f895732b0bed667f3bd59d802271bff18f43c7e86f7ee1799bbbbf8\"" -> "W/\"6e13265eb6c25997e8a6c41289809a08330efcee2d87c352f17369bda1e3735f\""
        id                          = "mirror-composer"
        name                        = "mirror-composer"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"fc90b7de809bb77f96fa4cb2bfecc616035f24ceddd3025f9b7b0f8801ad2aa4\"" -> "W/\"5c45ca6129e82c133542051ffb07ca13eefdf0dc0c2523abe945c4cf7c829507\""
        id                          = "mirror-composer-dependency-version-audit-plugin"
        name                        = "mirror-composer-dependency-version-audit-plugin"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-composer-root-update-plugin"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"1fed4fae2ce0f17d1dff01c55268e70316d1eece097e4ad7ef0bc6d4f6c19353\"" -> "W/\"0903971d57ce1935fc364c80fedd2843832e45dfa34c49b6991fefc87bf5bab6\""
        id                          = "mirror-composer-root-update-plugin"
        name                        = "mirror-composer-root-update-plugin"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-devdocs"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"889e10d1df280bebd59f43bd4759f80ba6583acc8254dd63f5fd8ff3c99b7e44\"" -> "W/\"4a4ae8628e8e1f1d91d2c57f83ed980cb78d51fcfcbec28753a2e6ff16874fd1\""
        id                          = "mirror-devdocs"
        name                        = "mirror-devdocs"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-inventory"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"dd390adb1dd41d6577da5a361f73d5b5ac0043062eede711a54ee296b745265c\"" -> "W/\"d224d2ac5c1a6bf3cf061c95be99acb6ac382284bf6876e919792227bc98ccd4\""
        id                          = "mirror-inventory"
        name                        = "mirror-inventory"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-inventory-composer-installer"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"819167acffb9ca9433556295488fb8922df3337eed1ca24a3b5446dd2759eedf\"" -> "W/\"f4d07062da8ec8619ea106df34cdf46b1b56165962a5e334177febbfd339be8c\""
        id                          = "mirror-inventory-composer-installer"
        name                        = "mirror-inventory-composer-installer"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-magento-composer-installer"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"3af596d46d88289e2e01c7cc5bff714c35b62f258b3fb3b9a10c592b558c34d8\"" -> "W/\"bf1981a6ebdda41ff793e3af5fa162d70b3f0933a0b8cba131d3a234baaad49c\""
        id                          = "mirror-magento-composer-installer"
        name                        = "mirror-magento-composer-installer"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-magento2"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"7235cde28feb7e0036c85fb23967ff7db52cd908619c31828710c7fd4cbd1890\"" -> "W/\"06f0719b84e10e3a4043f49b576c74405e1392f6472065b385c27cee13ccd053\""
        id                          = "mirror-magento2"
        name                        = "mirror-magento2"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-magento2-page-builder"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"c160ea8340c2d521c9c1949c66b7dfca4e48fd67bd612c4a0eab3073c2183b6f\"" -> "W/\"05866e21e550260531d33c930d4edc527fccacd4a0a11a275b6bbd3c589af58f\""
        id                          = "mirror-magento2-page-builder"
        name                        = "mirror-magento2-page-builder"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-magento2-sample-data"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"f9426a851223e94d38850ad839ec62c2710d38e485a8a23d009cf9af6597d7c2\"" -> "W/\"b79b04394977137aad5eb5a19d1c5c54302f7beb525ef813da24fee7217bdd6e\""
        id                          = "mirror-magento2-sample-data"
        name                        = "mirror-magento2-sample-data"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-module-configurable-sample-data-venia"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"04cfcc781686358f4f47d2747119953550f11e629206df02907a0dc2f2b7b0b6\"" -> "W/\"9c01ae98ea4a5954fc660b965346978635d5a5eadad7f55d2f6ca016d61da245\""
        id                          = "mirror-module-configurable-sample-data-venia"
        name                        = "mirror-module-configurable-sample-data-venia"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-page-builder-types"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"edd058cd17eb800b9d7f0a8691ed566d181e46f331219371af2b20c4b07d515b\"" -> "W/\"19cc79def51c99cd80549b97ebc3364130caacc54aef6519654a4b04b2fc8c9d\""
        id                          = "mirror-page-builder-types"
        name                        = "mirror-page-builder-types"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-security-package"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"1ab2e73c64b510838b7072725275918734448b33e09f49522d223871b7ea33b2\"" -> "W/\"fbe99a91cdd648fe8271e1f3eeaa79fb9080f58a008770b5da031ac0417b6708\""
        id                          = "mirror-security-package"
        name                        = "mirror-security-package"
        # (31 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-zf1"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                        = "W/\"082cccae0368802ebec14a27719faef7cc8aff0238700a486947b98732a423fc\"" -> "W/\"bd794806f9b06d675be22eba7eb2404f66ffba439113b4eb7537e2c0f2e795be\""
        id                          = "mirror-zf1"
        name                        = "mirror-zf1"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["dev-env-gitpod"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"5654a15e7113531b7e8d3f567bed53e962736a0307dd5a02ba8e7b598072c3a8\"" -> "W/\"8a39a183beba96c0f08f0032a52149cd109e39c15c859e58269b7de2bff5d427\""
        id                          = "dev-env-gitpod"
        name                        = "dev-env-gitpod"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["generate-mirror-repo-js"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"71427716601ceb4c2760320c5edfef2dccf0a9f7e5a9ae6fc8d5d2733815f826\"" -> "W/\"365f1011333b7bc1d8de49b0ef3f24e510babb7cf3bfc892e1229416862ef9f8\""
        id                          = "generate-mirror-repo-js"
        name                        = "generate-mirror-repo-js"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["infrastructure"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"41c603a99be5687f204046aa1f1363d46283fe7f664b7f758922acde82449751\"" -> "W/\"c5312e32a4810b143d19f481fed6b1eb86f1edae3220b5c1de0155bd50ce67c9\""
        id                          = "infrastructure"
        name                        = "infrastructure"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mage-os-website"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"15b1c1bebb3061ae4fc24ba8915ae54b0eaa518fee9b788cdfe34c86a72f131d\"" -> "W/\"3899255e15dfce7983875df3eb2f4a84da2ac8c0a94997a1e29a60205d059c0f\""
        id                          = "mage-os-website"
        name                        = "mage-os-website"
        # (32 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-adobe-stock-integration"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"81b1278e3f3eb5ce296fd27716d89b07a0a8cc3627a5814a8093328204bee1f9\"" -> "W/\"f36ab55e77c4e2d32ed49cd7241811c014d64469ce8836774abc2e23a4c8a156\""
        id                          = "mageos-adobe-stock-integration"
        name                        = "mageos-adobe-stock-integration"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-commerce-data-export"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"69b6dab884a3a0720cc3bc419997eeccd42eae6a7f5d5e934f6071625865ea49\"" -> "W/\"05f023a4d15f3f338172812e8d82ee77fd621289c91ba66ab658a75c128063d2\""
        id                          = "mageos-commerce-data-export"
        name                        = "mageos-commerce-data-export"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"c831af62724cf10479cafdfb9fdd3fb6bdc6c69718729524a80a00b444886ee5\"" -> "W/\"65ec001818106c0db2638efd1e4aaa46976f73c9d9fa958317f2576eed9cf3f9\""
        id                          = "mageos-composer-dependency-version-audit-plugin"
        name                        = "mageos-composer-dependency-version-audit-plugin"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-composer-root-update-plugin"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"82ce2eb3361ec7af3d9c467e406f7b8033f9c6ae938bbbe1b3c53dbf4b5b9454\"" -> "W/\"ef588eefe76f11b764341bfcec3ac60eb9c7470cbfe9d62466cd5a76da384310\""
        id                          = "mageos-composer-root-update-plugin"
        name                        = "mageos-composer-root-update-plugin"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-inventory"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"45f580e8cd3cfc074b3cea58b372ee57243f507e31c0d888e1722457ed897634\"" -> "W/\"b5e5652ca2ed3de7ffee61c6786aaed3ad5d0940a6724a8a91b8b711862d2aa3\""
        id                          = "mageos-inventory"
        name                        = "mageos-inventory"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-inventory-composer-installer"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"68f1627fd9e961a703cbf726b24f2700e642927c21ac152c43a23c360b34f47f\"" -> "W/\"c9f8fd8da9ac15596f84ee0ea3ad109bcf1d8533ae699bbe82fa1e1cb0e57258\""
        id                          = "mageos-inventory-composer-installer"
        name                        = "mageos-inventory-composer-installer"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-magento-composer-installer"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"24bc7114c5a84432e2c50e7b71a608fa66b8c7409a3a0569b7f0489f9e376301\"" -> "W/\"f9c97ec1d4c1b80c73af1a18d11c36d43775f0b368fd0801eb2d8346611ceae5\""
        id                          = "mageos-magento-composer-installer"
        name                        = "mageos-magento-composer-installer"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-magento2"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"55b05511a5c0def073ef25ed849eab879d065e292e142d6646cd7ff251dadda0\"" -> "W/\"de04bddb7de3d70494edad710b058f9b44aaa252909b81d97c8aa63e4b5e2fd0\""
        id                          = "mageos-magento2"
        name                        = "mageos-magento2"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-magento2-page-builder"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"51bc1427f80afa4f517373f89eb448bd6013689a8016d07eae034b3cf586cd35\"" -> "W/\"dddeeba917591321cf74a57f93f3d1f653129e4073d8e9165ba9c2368077c994\""
        id                          = "mageos-magento2-page-builder"
        name                        = "mageos-magento2-page-builder"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-magento2-sample-data"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"c63f7dce5b0fc3499b607c5c0ae3fea2a360b102e35523cc41434f53af9e8fb4\"" -> "W/\"a5a0b31ce91873b4b2b1989c2c88927538d8125ab8e80f6248ce5f8d7d58a924\""
        id                          = "mageos-magento2-sample-data"
        name                        = "mageos-magento2-sample-data"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-security-package"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"b71ee7197329604386eaf057a5e4e2abd3164ebae6c07fc5a5fcde6fd5d6b836\"" -> "W/\"191277be148ff24a3f316777bd558be52ec655de90dc1b64754e6546a154b33b\""
        id                          = "mageos-security-package"
        name                        = "mageos-security-package"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["namespace"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"dce8720febe3cf1fccf1de90bde727e328245ebf1c1ba73116844197d6ba0972\"" -> "W/\"74785114de74d7ec26cbfec85ec7aea271e58472fa4991834f1bf65c55345b3b\""
        id                          = "namespace"
        name                        = "namespace"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["terraform"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                        = "W/\"a7d2248c7e75a1456ee40f0f99d483dbf7c0193a35a53461913d311fba3178a9\"" -> "W/\"e71be9b4bfeb95de4a05c5bac9e61f3dcbf4b6b7c7fbf00da20e2ee1d42b12f7\""
        id                          = "terraform"
        name                        = "terraform"
        # (31 unchanged attributes hidden)
    }

  # github_team.teams["content"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"41eec8d4a7e00ca42aafe28a214c2d5cacb2ef5727b2e23e8e6986f60301c205\"" -> "W/\"be51618e4bcf39154c519563c7f98b9f7ed11c8895982d163e931b4a6ae3481f\""
        id                        = "6847102"
        name                      = "content"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["continuous-integration"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"b26e62bb7d9f13c5635337bb7df30a204fa88fd133768500142f58cd5e0e043c\"" -> "W/\"71f2d5284fdc89e51a56e6475a10be4127e01c1305ba0907f138dbda3617a205\""
        id                        = "6847099"
        name                      = "continuous-integration"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["distribution"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"006c80a7020419499732fea2dbfd7a888bf2d79eb73cfeb0f5326db09973405f\"" -> "W/\"77b6b65ee548465503bd6a534dc6876ccd94d32f64ee18f4d49dd6d8ca14373d\""
        id                        = "6847101"
        name                      = "distribution"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["infrastructure"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"06acbe01eef62b00ea5d2ab956ba74c250f3997030fc01e06c8b7ca622a157ec\"" -> "W/\"e3c8963c4b35343df10d4272da8e1e3a04c5b11b1cc86ce84083efc18e69dff6\""
        id                        = "6847100"
        name                      = "infrastructure"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["tech-lead"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"f2ff9d6f3082c60faac3b122c428734b8e2b6ed66d6e3df2b8f1224b166b000a\"" -> "W/\"52342690ed1c55c537e3f01ef542b05dbf8606646f2d80a2a19e7f81a4365996\""
        id                        = "6847098"
        name                      = "tech-lead"
        # (6 unchanged attributes hidden)
    }

  # github_team_membership.members["DavidLambauer_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"883dc1d603247385e647b4b73f7d2c570ff8672644489ff2f5d64ceee04c4654\"" -> "W/\"12bf645ab536ea25b2eeb1c297b1f0a7754adf33a01c27a95b680e97d24a8cb1\""
        id       = "6847100:DavidLambauer"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"4629542e51005d0d359b079be093e5bb7550578febe1f8aa7998b895a86618a1\"" -> "W/\"826c0008f87c50c8273199f502722e39dfa9ad913711fc77198326f3876f258b\""
        id       = "6847102:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"bf739259a2cbc75f80c675a8cf01528e25dcf57c1c606be1e7ce31bd6e366864\"" -> "W/\"945246560b29845be98a36385cba87cc3b03431471dcf288fee89f252dda6409\""
        id       = "6847101:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"387c75dd19498d0e3fc5a837bb04339996d841c689202193f3063be7a1343217\"" -> "W/\"558147e770be1c202b6e56267dff441e1ed5cf9df2f80e4770cfae29500db248\""
        id       = "6847100:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_tech-lead"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"b323c44409e6fc2415d4ad1de22dd0d6173773305dcbb07bcdb6e2fa8c00af53\"" -> "W/\"2e606dbb893d5fb533f0988645220bd8ca3a2bac0d017aee88338e7c63cfd050\""
        id       = "6847098:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"9cebfcf0abe72ae24200d1139fd1ccc550fcd49beb1f95da41a1f33ce788ddeb\"" -> "W/\"c6166799ddba0a81df6a27e56fccbd62c5b5b995899a61dc180e8187fd3c9207\""
        id       = "6847101:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"af91a4e1adc1494b85ba1fddb4ead1474858d1fa3138f932d6cbd1b143103a06\"" -> "W/\"e804b3d9c09eb19dda2d603170e64c46db9d317104bc18ddf05436928b18fc6c\""
        id       = "6847100:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["johnhughes1984_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"bb10f599168274f0523014a38f91bb489607f7d29b2c17953db15844ccdc5d9f\"" -> "W/\"b22f0b4d9c7dc966e6fd2fde9833f351c421558ab351dc575f874e44cee76aac\""
        id       = "6847102:johnhughes1984"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["mage-os-ci_continuous-integration"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"f90d49e98372f06d89044227a8f3911a8c221da0d7889ea33f5b0cc2747df340\"" -> "W/\"7fc3ca5cfb45f81cfc50ecbcfc08f0a5db8e102e6373a0f35d02a6beaaf2182e\""
        id       = "6847099:mage-os-ci"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"69a3d9fb93169efc8cf075560176829f47e453ac1bcf3ddd65157ae1b123c024\"" -> "W/\"92eba1ce2104c856f67dbba1d871095bad1dbbd78c4f3ac56091cc277b72f45c\""
        id       = "6847101:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"48d9b8913417a5cfc25cde4981b89e018d0fb5f99e8357e91c5b013625d163ba\"" -> "W/\"184d30c634d104e7873d6f33ccf52ddd6cd9a352992c9ca3ab189e51805474ea\""
        id       = "6847100:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["wigman_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"e3638a143d390f76b32ae404b6708a2cf32b9d9d9de30d255ff7acb1cf69c816\"" -> "W/\"4ada63a74b04404242a3688556f8247dd9a30527133e9fa8238bde8df23645fe\""
        id       = "6847102:wigman"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["dev-env-gitpod_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"f22f3ee4a071724ce386e9dbe95ddb414feb2c8d354e49a651d8842f1a4bd396\"" -> "W/\"f5004f6872f5856d0ddc467f69665410068494dcf4ed9a623224aa02bbed8840\""
        id         = "6847100:dev-env-gitpod"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["generate-mirror-repo-js_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"b7ed603ab068df6c004e5b26801b60cfb43c3e013acd9134a9ef13ec4a6e123a\"" -> "W/\"c27d78f779a6c9a3d4bd6a68e648e792838cc7705982915e6131751fa983faa6\""
        id         = "6847100:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["infrastructure_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"010f2db296c90916cd43fd8edee492fa1b35e1f1a61eb8af567171cf98ea847b\"" -> "W/\"b8ffbcb402fb260ede653b460d3cab812627e20f5541bc39ae35117fb821f07c\""
        id         = "6847100:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mage-os-website_content"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"e708b1aaf18bf22ffda6affd1cdde69c9fb3e814edde9f99efa4b45cf835bf29\"" -> "W/\"f8b0449e79d5799765bbfaec3d8ccab1f04c1c587ba60e81279cab6afde46880\""
        id         = "6847102:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-adobe-stock-integration_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"dae3b6aa6d5e19c479cd43502fc20e561a89bdb3186f975529f664146a0c64f8\"" -> "W/\"6553f040700ef03b57affdaa4227711f5a3cae9084b7ac229983138efa812964\""
        id         = "6847101:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-commerce-data-export_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"cb5dbfd742e43d8e28e7f9e28ac1c3fab8123fc806fada012f3bf243de3666b0\"" -> "W/\"2ccad4e92ca6a9e2132faaff488b49137bf3567e8e0398b3eb0b11c2ae695a57\""
        id         = "6847101:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"da4638a8921a33c817998f2f66ed718d9b3a1f5fdbf73a1b5d6e40bb65c8039f\"" -> "W/\"087b390896a47d747d1ae872d2dfd92c8dc00640ec93f9a388ea09c714ffe1ae\""
        id         = "6847101:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-root-update-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"af19dd7c86341d637ee7f75ba53e6d774363381b0617c0d122235eb41e90b479\"" -> "W/\"a81b7752d8fa9d5c19b0d65c4c5f393ca7601d77c49d0065331e4262ebc18449\""
        id         = "6847101:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"3e328c8e4a3c97f905496eaed336ace6b2a420143d0cbeda545b766dbde12869\"" -> "W/\"46c3787851c544d71e01f9546547b53ce048e3746e87cce705a5654f23022ccd\""
        id         = "6847101:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"24271b53b07e65e2552a6ee114b0f67781485b2db46351492bf2f7e683afaa5b\"" -> "W/\"015db1d2408d583647c1f0fa74b0dadbfe67990b691c471d5cf7978f1bb0e03d\""
        id         = "6847101:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"75ce203b8c48399aa5a8cf3cab71c576e19d85f3da3624e37e1dc108910c550b\"" -> "W/\"4c1d3737d02535c406dd090e1e69a866c97c63bfb3d02da23d37b98bc0166f61\""
        id         = "6847101:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-page-builder_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"ae045e8a3b0f3a104516e6aab07a0fbc8052ca646f4b075e7f6a538bad0a4261\"" -> "W/\"ed11601e25b696e4d615ff8947cbe1718861d83a5f4f9e1b7549b9a5f74f8317\""
        id         = "6847101:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-sample-data_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"b74b46e6a3044c2857a3678e74cc0c4feb58adad6af320f10243f2333092b070\"" -> "W/\"3824acf0464717a4fb19b6ea4ae05453044a153e4da52ca97fa8180c3d60d1f3\""
        id         = "6847101:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"ae07c298e79a5eab94a23e958519c915e599f35b8744d882b7402241e5389ec0\"" -> "W/\"83e5c57f3ebbe6733104081b5cb89583bd3eed72be993cff98324f91b08b4815\""
        id         = "6847101:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-security-package_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"119526ef34e31990db46ef8c8a79ee1c3924a1361c16fe12bc72feb34ab7ef08\"" -> "W/\"d258b33138da7aaec46fe2920df1249058fa2b2ad3dc8b450c4bf884dc0da867\""
        id         = "6847101:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["namespace_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"e958bbfdeef586ab358f1d0506902be2bd9642a156d6421795189ba7027338b1\"" -> "W/\"9a09e5e2c213e7905315d9e7313db8ee9dde5f8428c587d15f7d2aee34ea7896\""
        id         = "6847100:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["terraform_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"79794ba31a1fda43b3f68171f7949d2e1f057269182851e269281f64d4c1d1be\"" -> "W/\"826cc1ced1ba03c3b29780751cb94f97db83ebf6f9d624e84aac9b66b4cd9757\""
        id         = "6847100:terraform"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["dev-env-gitpod"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"85601269b81f1bc4d6fafcf7cb75d9a09cab3846283bdb7718b0dc8c95cb585f\"" -> "W/\"2b8c6341b78c0c9d1415d6e7c31dd6f668adb5e7b131d85c7930d3ab485386bc\""
        id         = "6847098:dev-env-gitpod"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["generate-mirror-repo-js"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"1e3a632dcacdca1ec9847a9a924dff3967a3a7209dc185e7b1881e26ee7b42e1\"" -> "W/\"e868fe7c953865b2be4e661898f2e5e26229acab709052890b14395c2a99af59\""
        id         = "6847098:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["infrastructure"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"bb3becab18849f3436e2f50a401a97fa00eb4163f7af7bfbf96a1474b0f25240\"" -> "W/\"f0020ee10a5cb0b0efbf91eaf2f77a73a1e5dd218914048b7ce3bd8a181da43c\""
        id         = "6847098:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mage-os-website"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"f5fe40d11bdfdbc7abe19496fe26511564c69f94bf7697c392fa70d79588e464\"" -> "W/\"14e320d61dc92ec00acd63b19dc1e6a8c73bbac9f67470a82f6635b60f09cd5f\""
        id         = "6847098:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-adobe-stock-integration"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"9bd421b052d91eb7d12c4037cfe73ff4466647794a3799b8369845b0f4b348c1\"" -> "W/\"a390114eeac94c355101021b61a3a70601460128788e6f011a9fcadb98c7e96e\""
        id         = "6847098:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-commerce-data-export"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"ba331bdf28a6e67fcace18027fcf246cb379d25280653d0a690b1b2e144b82ea\"" -> "W/\"ff105338e2aee4144509be66bae284d581f022ea6ec20d4305fc8a5ac00558c1\""
        id         = "6847098:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"d0dcfdc41173c9b41a8ab4c5844880dc3c763ecfcddbeb8dd47695e76622e575\"" -> "W/\"a1c47a387d097bafc4fc261747fa56f4701089f5a37e3b030e77c0164932de08\""
        id         = "6847098:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-root-update-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"a9efa5c6ff99f74d5601ef88d9d56c24c7f8212ddc5aa471712035591179147d\"" -> "W/\"eec4dd540f0fc2d2da9401a1e76583f207c24cb1dc118644f843bd37945e73c1\""
        id         = "6847098:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"80b99f37750494d9787a71baede4b7810afdf61cdf150159fd6fc4de4c14e6ee\"" -> "W/\"28ba4e1930643bc0094d4b5897b7d867597e587e0de9fb538a900c9c19e01457\""
        id         = "6847098:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"2446d4b91a5e3a84d639ffe06f60ac3a8d5f75ab9d8cc262c2baa742ea190778\"" -> "W/\"2b6b28d7ccd69642f4414a3ade684557420a26592a9e3e23f07abcbf85d60a36\""
        id         = "6847098:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"a297585ead1951ace34534635a64314a1c8696b52a934207ebdaeb8aa1941beb\"" -> "W/\"b2e0d45e4b55e8704fec4bec1094d5832aa4ef76a64a33a3ef67e5cf563fb157\""
        id         = "6847098:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"7bd4d5f8a3a636632379a4b6dd0055b6f42696b002d37c01358a6a0c9ae0a151\"" -> "W/\"8dba526c5cb717a6207270ef2e02a76e859d88fcf545618d32a56ac46c35dc95\""
        id         = "6847098:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-page-builder"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"a95d4c1f2662e55a0cb4893c14facedf0645e729046dfdcc9e25e62349cee30f\"" -> "W/\"f9ea4432c50664291dbe35925af0c94f0d7f603eb5a75bfc6b0633a92770fc84\""
        id         = "6847098:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-sample-data"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"f5022484e5055107540e03a02b9c8f74437e93ab56ffd7b7930aef4124fdfcff\"" -> "W/\"ffd95a6110815cb6151528310e2f4fccb35edec2a13ba51944d450739461c59a\""
        id         = "6847098:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-security-package"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"2f1a0ea92f5058d835e345f9f7917c9d97ef3e2f0b49f33572263e9a9cc5169e\"" -> "W/\"8eea51f54183479d8a738588065656b8d1e57a25e7d3be46ac88a7c80a1609b2\""
        id         = "6847098:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["namespace"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"460dde2708cc48b87eeadd9df8cc30a294d54747c747e2f56398b132d343807f\"" -> "W/\"f5de734e1ca0e32311a4fb5a2ce9f823e529e804dbcf1c93f6c3c9ef7979294e\""
        id         = "6847098:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["terraform"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"417029fe7a4edd99a2944ed7dff0506747dc13abd7edc6a6c198c55820d8bf22\"" -> "W/\"9d7438de38a0ffcd1d57bf80f2b0c830d74bfc23fecc9803c8b554a6fcd22f2b\""
        id         = "6847098:terraform"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.mirrors["mirror-magento-cloud-patches"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_branch_protection.mirrors["mirror-quality-patches"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_branch_protection.repositories["mageos-async-events"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_branch_protection.repositories["meta"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOBWesqs4AaHp6",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_repository.mirrors["mirror-magento-cloud-patches"] will be created
  + resource "github_repository" "mirrors" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Mage-OS mirror fork of https://github.com/magento/magento-cloud-patches."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "mirror-magento-cloud-patches"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
    }

  # github_repository.mirrors["mirror-quality-patches"] will be created
  + resource "github_repository" "mirrors" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Mage-OS mirror fork of https://github.com/magento/quality-patches."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "mirror-quality-patches"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
    }

  # github_repository.repositories["mageos-async-events"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "This is a Mage-OS repo for the porting of the Magento Asynchronous Events Project found at https://github.com/aligent/magento-async-events."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "mageos-async-events"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
    }

  # github_repository.repositories["mageos-security-package"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ description                 = "This is a Mage-OS fork of the Magento Security Extensions project found at https://github.com/magento/security-package." -> "This is a Mage-OS fork of the Magento Security Extensions Project found at https://github.com/magento/security-package."
        id                          = "mageos-security-package"
        name                        = "mageos-security-package"
        # (31 unchanged attributes hidden)
    }

  # github_repository.repositories["meta"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "This is a Mage-OS repo for documents like the contribution/review guidelines."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "meta"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
    }

  # github_repository_file.codeowners["mageos-async-events"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = (known after apply)
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/distribution"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "mageos-async-events"
      + sha                 = (known after apply)
    }

  # github_repository_file.codeowners["meta"] will be created
  + resource "github_repository_file" "codeowners" {
      + branch              = (known after apply)
      + commit_author       = "Mage-OS CI Bot"
      + commit_email        = "info+ci@mage-os.org"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = "* @Mage-OS/tech-lead @Mage-OS/infrastructure @Mage-OS/content @Mage-OS/distribution @Mage-OS/continuous-integration"
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "meta"
      + sha                 = (known after apply)
    }

  # github_team_repository.teams["mageos-async-events_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "mageos-async-events"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["meta_content"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "meta"
      + team_id    = "content"
    }

  # github_team_repository.teams["meta_continuous-integration"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "meta"
      + team_id    = "continuous-integration"
    }

  # github_team_repository.teams["meta_distribution"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "meta"
      + team_id    = "distribution"
    }

  # github_team_repository.teams["meta_infrastructure"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "meta"
      + team_id    = "infrastructure"
    }

  # github_team_repository.teams["meta_tech-lead"] will be created
  + resource "github_team_repository" "teams" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "meta"
      + team_id    = "tech-lead"
    }

  # github_team_repository.tech-lead["mageos-async-events"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "mageos-async-events"
      + team_id    = "6847098"
    }

  # github_team_repository.tech-lead["meta"] will be created
  + resource "github_team_repository" "tech-lead" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "meta"
      + team_id    = "6847098"
    }

Plan: 18 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Issuer: @sprankhub, Action: https://github.com/mage-os/terraform/actions/runs/4399175106